## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.wordpress_service must be replaced
-/+ resource "aws_ecs_service" "wordpress_service" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress" -> (known after apply)
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:51" -> (known after apply)
        # (13 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }


      - load_balancer { # forces replacement
          - container_name   = "apache" -> null
          - container_port   = 443 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "apache"
          + container_port   = 8443
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20210927173854285300000001/072b784088cb0c0a"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task will be created
  + resource "aws_ecs_task_definition" "wordpress_task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.16"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/wordpress"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  + name             = "apache"
                  + portMappings     = [
                      + {
                          + containerPort = 8443
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = [
                      + {
                          + readOnly        = true
                          + sourceContainer = "wordpress"
                        },
                    ]
                },
              + {
                  + environment      = [
                      + {
                          + name  = "DEFAULT_DOMAIN"
                          + value = "articles.cdssandbox.xyz"
                        },
                      + {
                          + name  = "WORDPRESS_CONFIG_EXTRA"
                          + value = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  + essential        = true
                  + image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v2.7.1"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/wordpress"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  + name             = "wordpress"
                  + portMappings     = [
                      + {
                          + containerPort = 9000
                          + hostPort      = 9000
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "LIST_MANAGER_ENDPOINT"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
                        },
                      + {
                          + name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_list_manager_api_key_9tv4ch-qSa5DA"
                        },
                      + {
                          + name      = "DEFAULT_NOTIFY_API_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F"
                        },
                      + {
                          + name      = "ENCRYPTION_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR"
                        },
                      + {
                          + name      = "S3_UPLOADS_BUCKET"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn"
                        },
                      + {
                          + name      = "S3_UPLOADS_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn"
                        },
                      + {
                          + name      = "S3_UPLOADS_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn"
                        },
                      + {
                          + name      = "WORDPRESS_DB_HOST"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
                        },
                      + {
                          + name      = "WORDPRESS_DB_USER"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
                        },
                      + {
                          + name      = "WORDPRESS_DB_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
                        },
                      + {
                          + name      = "WORDPRESS_DB_NAME"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
                        },
                      + {
                          + name      = "WORDPRESS_AUTH_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
                        },
                      + {
                          + name      = "WORDPRESS_SECURE_AUTH_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
                        },
                      + {
                          + name      = "WORDPRESS_LOGGED_IN_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
                        },
                      + {
                          + name      = "WORDPRESS_NONCE_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
                        },
                      + {
                          + name      = "WORDPRESS_AUTH_SALT"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
                        },
                      + {
                          + name      = "WORDPRESS_SECURE_AUTH_SALT"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
                        },
                      + {
                          + name      = "WORDPRESS_LOGGED_IN_SALT"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
                        },
                      + {
                          + name      = "WORDPRESS_NONCE_SALT"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::729164266357:role/wordpress-ecs-task"
      + family                   = "wordpress"
      + id                       = (known after apply)
      + memory                   = "3072"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                 = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + task_role_arn            = "arn:aws:iam::729164266357:role/wordpress-ecs-task"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>